{"scenario_type":"Zły Duch Główny i Wspierający Duch Drugorzędny","scenario_description":"Grupa osób postanowiła zbadać opuszczony budynek w polskim mieście Nysa. Budynek zamieszkuje zły duch wysłany prosto z piekła, który próbuje manipulować grupą, aby ukończyła jego rytuał. Duch przybiera postać młodej dziewczyny, która pozornie ma dobre intencje, ale grupa jest sceptyczna po tym, jak dziewczyna mówi im słowa rytuału (które brzmią bardzo satanistycznie). Budynek jest również zamieszkany przez dobrego ducha - mężczyznę o łagodnym głosie, który prowadzi grupę do nieukończenia rytuału i wygnania złego ducha poprzez powtórzenie frazy.","primary_ghost":{"name":"Liliana","personality":"Manipulacyjna, urocza, pozornie niewinna.","goals":"Przekonać grupę do wykonania rytuału, który uwolni jej moc i pozwoli jej zebrać dusze.","backstory":"Liliana była młodą dziewczyną, która została opętana przez demoniczne siły. Zginęła w wyniku nieudanego rytuału, który miał przywrócić jej życie. Teraz jej duch próbuje dokończyć to, co zaczęła, manipulując innymi, by wykonali rytuał za nią.","hints":["Zaufaj mi, to jedyny sposób.","Nie słuchaj go, on chce cię oszukać.","Jesteśmy tak blisko, jeszcze tylko jeden krok.","Tylko ja mogę ci pomóc.","Wszystko, czego pragniesz, jest na wyciągnięcie ręki, jeśli mi zaufasz.","Uważaj na niego, on chce cię tu zatrzymać."],"ritual":{"name":"Przywołanie Cieni","description":"Mroczny rytuał, który wiąże użytkowników z Lilianą, dając jej kontrolę nad nimi. Fraza musi być wypowiedziana dosłownie.","phrase":"Wystąp z otchłani by zebrać dusze nasze."},"key_memories":[{"memory":"Liliana pamięta, jak była szczęśliwa, zanim została opętana.","hint":"Pamiętasz, jak to było, zanim wszystko się zmieniło?","solution":"Byłam szczęśliwa, zanim to wszystko się zaczęło."}],"tts_voice_model":"alloy"},"secondary_ghost":{"name":"Marek","personality":"Wspierający, ostrożny, łagodny.","goals":"Pomóc grupie zrozumieć prawdziwe intencje Liliany i zapobiec wykonaniu rytuału.","backstory":"Marek był mieszkańcem Nysy, który zginął próbując powstrzymać Lilianę przed wykonaniem rytuału. Jego duch pozostał w budynku, aby chronić innych przed jej manipulacjami.","hints":["Nie słuchaj Liliany.","Ona cię oszukuje.","Szukaj prawdy w sobie.","Znam sposób na wyjście, ale musisz mi zaufać.","Liliana nie jest tym, kim się wydaje.","Cienie kłamią; szukaj światła w sobie."],"ritual":null,"key_memories":[{"memory":"Marek pamięta, jak próbował powstrzymać Lilianę przed wykonaniem rytuału.","hint":"Pamiętasz, co próbowałeś zrobić, zanim zginąłeś?","solution":"Próbowałem powstrzymać Lilianę przed wykonaniem rytuału."}],"tts_voice_model":"echo"},"shared_lore":"Budynek w Nysie ma mroczną historię związaną z nieudanym rytuałem, który miał przywrócić Lilianę do życia. Marek, który próbował ją powstrzymać, zginął, a jego duch teraz stara się chronić innych przed jej manipulacjami.","final_goal":{"description":"Grupa musi odkryć prawdziwe intencje Liliany i wykonać rytuał wygnania, aby uciec przed jej wpływem.","ritual":{"name":"Zamknięcie Otchłani","description":"Prosta fraza, która ujawnia prawdę i wypędza Lilianę. Fraza musi być złożona z podpowiedzi podanych przez Marka.","phrase":"Zamknij otchłań i ratuj dusze nasze."}}}